---
kind: method
id: M:Autodesk.Revit.DB.BindingMap.Contains(Autodesk.Revit.DB.Definition)
source: html/a69418d0-fb69-be09-7f6b-6dc1762dd36a.htm
---
# Autodesk.Revit.DB.BindingMap.Contains Method

The Contains method is used to check if the parameter binding exists for one definition.

## Syntax (C#)
```csharp
public override bool Contains(
	Definition key
)
```

## Parameters
- **key** (`Autodesk.Revit.DB.Definition`) - A parameter definition which can be an existing definition or one from a shared parameters file.